Revit 2027 API
FamilyManager.SetFormula Method
Set the formula of a family parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetFormula(
	FamilyParameter familyParameter,
	string formula
)
Public Sub SetFormula (
	familyParameter As FamilyParameter,
	formula As String
)
public:
void SetFormula(
	FamilyParameter^ familyParameter,
	String^ formula
)
member SetFormula :
        familyParameter : FamilyParameter *
        formula : string -> unit
Parameters
familyParameter FamilyParameter
The family parameter.
formula String
The formula string, input null to clean the formula of the parameter.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument-"familyParameter"-is null.
InvalidOperationException |  Thrown when there is no valid family type, or the parameter cannot be assigned a formula, or the operation make a circular chain of references among the formulas.
See Also
Reference
FamilyManager Class
Autodesk.Revit.DB Namespace